// М.В. Катеринич, 24.05.2023 19:53:34  }

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Поля.Добавить("Наименование"); 
	Поля.Добавить ("ДействуетНаОсновании"); 
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;   
	
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
	
		Представление = СтрШаблон("%1 (%2)",Данные.Наименование, Данные.ДействуетНаОсновании);
		
	Иначе 
		
		Представление = Данные.Наименование; 
	КонецЕсли;
	 
КонецПроцедуры

#КонецОбласти
 
 // М.В. Катеринич, 24.05.2023 20:06:29  }